In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import re
import sklearn

In [50]:
#문자열 slicing
#coding rest 로 바꾸기
string="coding test"

In [51]:
#방법 1
temp=list(string)
temp[temp.index('t')]='r'
string="".join(temp)
print(string)

coding rest

In [52]:
#방법2
string="coding test"
string=string[:string.index('t')]+'r'+string[string.index('t')+1:]
print(string)

coding rest

In [53]:
#index 찾기
string = "Python is the bbest choice"
#가장 첫 인덱스 출력
print(string.find('b'))
#없으면 -1 return
print(string.find('k'))

14
-1

In [54]:
#문자열 바꾸기
string = "Life is too short"
string=string.replace("Life", "Your leg")
string

'Your leg is too short'

In [55]:
#문자열 나누기
a = "Life is too short"
a.split()

['Life', 'is', 'too', 'short']

In [56]:
b = "a:b:c:d"
b.split(':')

['a', 'b', 'c', 'd']

In [66]:
import re
# \d - 숫자와 매치, [0-9]와 동일한 표현식이다.
# \D - 숫자가 아닌 것과 매치, [^0-9]와 동일한 표현식이다.
# \s - whitespace 문자와 매치, [ \t\n\r\f\v]와 동일한 표현식이다. 맨 앞의 빈 칸은 공백문자(space)를 의미한다.
# \S - whitespace 문자가 아닌 것과 매치, [^ \t\n\r\f\v]와 동일한 표현식이다.
# \w - 문자+숫자(alphanumeric)와 매치, [a-zA-Z0-9_]와 동일한 표현식이다.
# \W - 문자+숫자(alphanumeric)가 아닌 문자와 매치, [^a-zA-Z0-9_]와 동일한 표현식이다.
# # +는 최소 1번 이상 반복될 때 사용한다.
# *는 최소 0번 이상 반복
p = re.compile('[a-z]+')
m = p.match("python")
m

In [67]:
#\w == [a-zA-Z0-9_]
p = re.compile(r'\w+')
m = p.match("python")
m

In [68]:
m = p.match("3 python")
m

In [69]:
m = p.match( 'string12 goes here' )
if m:
    print('Match found: ', m.group())
else:
    print('No match')

Match found:  string12

In [70]:
result = p.findall("life is too short")
print(result)

['life', 'is', 'too', 'short']

In [71]:
#.은 \n제외한 모든 문자와 매치
p =  re.compile(r'a.+b')
m=p.match("asfsddsfdss,,nn..nbb,,b")
m

In [72]:
#[.]은 문자.를 의미
p =  re.compile(r'a.+b')
m=p.match("a.....b")
m

In [73]:
# {m, n} 정규식을 사용하면 반복 횟수가 m부터 n까지 매치할 수 있다
p= re.compile(r'a.{2,5}b')
m=p.match('a...b')
m

In [75]:
import re 

data = """
park 800905-1049118
kim  700905-1059119
"""

pat = re.compile("(\d{6})[-](\d{7})")
print(pat.sub("\g<1>-*******", data))

park 800905-*******
kim  700905-*******

In [98]:
#pandas에서 Regex의 응용

df=pd.DataFrame()
df['phonenumber']=['010-1234-8245','010-1334-5678']
df['name']=['940927-1840611','932020-1234123']

In [99]:

def star(name):
    p= re.compile(r'(\d{3}[-]\d{4}[-])(\d{4})')
    return p.sub("\g<1>****", name)
   


df["phonenumber"]=df["phonenumber"].apply(star)
df

     phonenumber            name
0  010-1234-****  940927-1840611
1  010-1334-****  932020-1234123

In [148]:
df['phonenumber']=['010-3122-8245','010-1233-5678']
df['humannumer']=['940927-123456','932020-1234123']
df['name']=['fa','ba']
cols = df.columns.tolist()
#위치바꾸끼
cols = [cols[1]]+cols[:1]+cols[2:]
df=df[cols]
df

  name    phonenumber      humannumer
0   fa  010-3122-8245   940927-123456
1   ba  010-1233-5678  932020-1234123

In [149]:
# Total items starting with F
df['name'].str.count(r'(^f.*)').sum()

1

In [150]:
# Get cus starting with letter f
df[df['name'].str.match(r'(^f.*)')==True]

  name    phonenumber     humannumer
0   fa  010-3122-8245  940927-123456

In [151]:
# replace

df['phonenumber'].replace(r'(-(\d{4})-(\d{4}))','-\g<3>-\g<2>',regex=True, inplace = True)
df

C:\Users\Changgwon\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\generic.py:6586: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

  name    phonenumber      humannumer
0   fa  010-8245-3122   940927-123456
1   ba  010-5678-1233  932020-1234123

In [153]:
#find all
[itm[0] for itm in df['name'].str.findall('^[f].*') if len(itm)>0]

['fa']

In [154]:
#split
df['phonenumber'].str.split(r"-", n=-1,expand=True)

     0     1     2
0  010  8245  3122
1  010  5678  1233

In [13]:
import pandas as pd
df = pd.DataFrame({'고객번호' : ['C1', 'C2', 'C2', 'C2'],
                   '상품번호' : ['P1', 'P1', 'P2', 'P2'],
                   '수량' :     [2, 3, 5, 10]})
df

  고객번호 상품번호  수량
0   C1   P1   2
1   C2   P1   3
2   C2   P2   5
3   C2   P2  10

In [16]:
#수량이 max인 것 뽑는 코드
idx=df.groupby(by='고객번호')['수량'].transform(max) ==df['수량']
new_df=df[idx]
new_df.reset_index(inplace=True)
new_df

   index 고객번호 상품번호  수량
0      0   C1   P1   2
1      3   C2   P2  10

In [6]:
df_left = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']})
df_left

  KEY   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [9]:
df_right = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],'C': ['C2', 'C3', 'C4', 'C5'],'D': ['D2', 'D3', 'D4', 'D5']})
df_right

  KEY   C   D
0  K2  C2  D2
1  K3  C3  D3
2  K4  C4  D4
3  K5  C5  D5

In [12]:
#Outerleft join
df_merge_how_left = pd.merge(df_left, df_right,how="left",on='KEY')
df_merge_how_left

  KEY   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [19]:
#Outer right join
df_merge_how_right = pd.merge(df_left, df_right,how="right",on='KEY')
df_merge_how_right

  KEY    A    B   C   D
0  K2   A2   B2  C2  D2
1  K3   A3   B3  C3  D3
2  K4  NaN  NaN  C4  D4
3  K5  NaN  NaN  C5  D5

In [20]:
#inner join
df_merge_how_inner = pd.merge(df_left, df_right,how="inner",on='KEY')
df_merge_how_inner

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [21]:
#full outer join
df_merge_how_outer = pd.merge(df_left, df_right,how="outer",on='KEY')
df_merge_how_outer

  KEY    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5